web/tutorials/precice/twophase_right/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;
//startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10.;

deltaT          0.05;

writeControl    adjustable;

writeInitial    yes;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1;

maxAlphaCo      1;

maxDeltaT       0.01;

libs ("libpreciceAdapterFunctionObject.so");
functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
    }
}
